Revit 2027 API
STLExportOptions.ExportBinary Property
 True to export in binary STL format, false to export in ASCII STL format. Default value is true.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool ExportBinary { get; set; }
Public Property ExportBinary As Boolean
	Get
	Set
public:
property bool ExportBinary {
	bool get ();
	void set (bool value);
}
member ExportBinary : bool with get, set
Property Value
Boolean
See Also
Reference
STLExportOptions Class
Autodesk.Revit.DB Namespace